[
  {
    "AssemblyVersion": "0.3.5.0",
    "DalamudApiLevel": 13,
    "ChangeLog": "- Garden patches now have information about their residential area, and the patches from different areas won't be highlighted. Patches in different instance of the same area (for instance lavender beds ward 12 and ward 16) will still show, nothing I can do about that without a ton of work. Not worth it.\n- Flowerpots are now counted as separate entities each, instead of being sometimes merged into one.\n- Newly registered plots or flowerpots will have the area name (for instance, Mist L 1 would be in a Large house in Mist)\n- Moved plots' location is updated when you see them again\n- Removed plots will print a warning so the user know they should delete them\n- Throttled and optimized the garden patch background lookup. It still only runs when the main window is open.\n- Flowerpots refuse to work properly. Just don't use this for flowerpots. Just don't.",
    "IsTest": false
  },
  {
    "AssemblyVersion": "0.3.0.0",
    "DalamudApiLevel": 13,
    "ChangeLog": "- Fixed seeds and soils indexes being mixed. Woopsie.\n- Fixed having flowerpot-only seeds messing up planting outdoors\n- Added support for flowerpots\n- Added support for french and german language clients\n- Planting with the plugin now also updates the data for the plot\n- The button to create a new design now mentions the number of slots in the nearest plot, instead of the name",
    "IsTest": false
  },
  {
    "AssemblyVersion": "0.2.1.0",
    "DalamudApiLevel": 13,
    "ChangeLog": "- Fixed save manager loading an empty save before login and then not updating it on character login\nFixed some errors happening when not logged in",
    "IsTest": false
  },
  {
    "AssemblyVersion": "0.2.0.1",
    "DalamudApiLevel": 13,
    "ChangeLog": "- Tweaked Fertilize task\n- Added a toggle to disable autoharvest\n- Updated scarecrow picture with positionals",
    "IsTest": false
  },
  {
    "AssemblyVersion": "0.2.0.0",
    "DalamudApiLevel": 13,
    "ChangeLog": "- Added automovement to garden patches. This can also be used as a chain of plots and chat commands to automatically tend multiple plots in a row. For instance, tend two at your private state, then us /li fc from Lifestream, and tend to other three in the FC house.\n- Fixed system getting stuck if you try to harvest with a full inventory\n- If the plugin gets stuck on Fertilizing, it just skips the step instead of the whole plot",
    "IsTest": false
  },
  {
    "AssemblyVersion": "0.1.0.1",
    "DalamudApiLevel": 13,
    "ChangeLog": "- Fixed system getting stuck if you try to harvest with a full inventory",
    "IsTest": false
  },
  {
    "AssemblyVersion": "0.1.0.0",
    "DalamudApiLevel": 13,
    "ChangeLog": "-Single patch tending finished",
    "IsTest": false
  },
  {
    "AssemblyVersion": "0.0.1.1",
    "DalamudApiLevel": 12,
    "ChangeLog": "First release",
    "IsTest": false
  },
  {
    "AssemblyVersion": "0.0.1.0",
    "DalamudApiLevel": 12,
    "ChangeLog": "First release",
    "IsTest": false
  }
]
